app/views/pirates/show.html.erb

<!-- TODO: Iterate over the pirate's ships -->
<!-- Example: @pirate.ships.each do |ship| -->
---
SELECT "ships".* FROM "ships" WHERE "ships"."pirate_id" = ?  [["pirate_id", 1]]