app/controllers/pirates_controller.rb

INSERT INTO "ships" ("name", "type", "booty", "pirate_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Titanic"], ["type", "Steam Liner"], ["booty", "Silver"], ["pirate_id", 1], ["created_at", "2025-08-12 19:12:58.075001"], ["updated_at", "2025-08-12 19:12:58.075001"]]
---
  def create
    # Handle form submission and create pirate with ships
    @pirate = Pirate.new(pirate_params.except(:ships))

    # Create ships from nested params
    @ships = []
    if pirate_params[:ships].present?
      pirate_params[:ships].each do |ship_params|
        @ships << Ship.new(ship_params) if ship_params.values.any?(&:present?)

SELECT "pirates".* FROM "pirates" WHERE "pirates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ships".* FROM "ships" WHERE "ships"."pirate_id" = ?  [["pirate_id", 1]]
---
  def show
    # Display pirate and ship information
    @pirate = Pirate.find(params[:id])
    @ships = Ship.all.last(2) # Get the last 2 ships created