app/controllers/pirates_controller.rb

  def create
    # Handle form submission and create pirate with ships using nested attributes
    # Convert ships array to ships_attributes format for ActiveRecord
    processed_params = pirate_params.dup
    processed_params[:ships_attributes] = processed_params.delete(:ships) if processed_params[:ships].present?

    @pirate = Pirate.new(processed_params)

    if @pirate.save
---
INSERT INTO "pirates" ("name", "weight", "height", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ian"], ["weight", "165"], ["height", "95"], ["created_at", "2025-08-12 19:12:58.074378"], ["updated_at", "2025-08-12 19:12:58.074378"]]